load-tests/results/high-traffic-20260906-avail-500x500-r4/k6-console.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /work/load-tests/k6/high-traffic-500vu-10000.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 10m30s max duration (incl. graceful stop):
              * high_traffic_booking: 500 iterations shared among 500 VUs (maxDuration: 10m0s, gracefulStop: 30s)


Run                    [ 100% ] setup()
high_traffic_booking   [   0% ]

Run                    [ 100% ] setup()
high_traffic_booking   [   0% ]

running (00m02.9s), 500/500 VUs, 0 complete and 0 interrupted iterations
high_traffic_booking   [   0% ] 500 VUs  00m00.6s/10m0s  000/500 shared iters

running (00m03.9s), 459/500 VUs, 41 complete and 0 interrupted iterations
high_traffic_booking   [   8% ] 500 VUs  00m01.6s/10m0s  041/500 shared iters

running (00m04.9s), 340/500 VUs, 160 complete and 0 interrupted iterations
high_traffic_booking   [  32% ] 500 VUs  00m02.6s/10m0s  160/500 shared iters

running (00m05.9s), 203/500 VUs, 297 complete and 0 interrupted iterations
high_traffic_booking   [  59% ] 500 VUs  00m03.6s/10m0s  297/500 shared iters


  █ TOTAL RESULTS 

    checks_total.......: 1000    148.507884/s
    checks_succeeded...: 100.00% 1000 out of 1000
    checks_failed......: 0.00%   0 out of 1000

    ✓ reservation response has an id
    ✓ reservation response is pending

    CUSTOM
    cancellations_succeeded............: 0      0/s
    errors_idempotency_in_progress.....: 0      0/s
    errors_rate_limited................: 0      0/s
    errors_sold_out....................: 0      0/s
    errors_user_limit..................: 0      0/s
    reservation_server_faults..........: 0      0/s
    reservation_unexpected_responses...: 0      0/s
    reservations_accepted..............: 500    74.253942/s
    reservations_created...............: 500    74.253942/s
    reservations_replayed..............: 0      0/s
    reserve_latency....................: avg=2.9s  min=892.66ms med=3.15s p(90)=3.94s p(95)=4.03s p(99)=4.13s max=4.2s 

    HTTP
    http_req_duration..................: avg=2.89s min=263.06ms med=3.15s p(90)=3.94s p(95)=4.03s p(99)=4.13s max=4.2s 
      { expected_response:true }.......: avg=2.89s min=263.06ms med=3.15s p(90)=3.94s p(95)=4.03s p(99)=4.13s max=4.2s 
    http_req_failed....................: 0.00%  0 out of 503
    http_reqs..........................: 503    74.699466/s

    EXECUTION
    iteration_duration.................: avg=2.98s min=1.01s    med=3.25s p(90)=3.98s p(95)=4.05s p(99)=4.18s max=4.23s
    iterations.........................: 500    74.253942/s
    vus................................: 203    min=0        max=500
    vus_max............................: 500    min=500      max=500

    NETWORK
    data_received......................: 389 kB 58 kB/s
    data_sent..........................: 292 kB 43 kB/s



running (00m06.7s), 000/500 VUs, 500 complete and 0 interrupted iterations
high_traffic_booking ✓ [ 100% ] 500 VUs  00m04.5s/10m0s  500/500 shared iters